---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.DisabledDisciplineException
source: html/04f9b2e2-dbac-ece3-547f-2ad0670da614.htm
---
# DisabledDisciplineException Methods

Retrieves data needed to serialize the target object.